import React from "react";
import { Container, Tabs, Tab } from "react-bootstrap";
import "./style.css";
import Tab11 from "./components/Tab1/Tab1_1.js";
import Tab12 from "./components/Tab1/Tab1_2.js";
import Tab2 from "./components/Tab2/Tab2.js";
import Tab3 from "./components/Tab3/Tab3.js";
import Tab4 from "./components/Tab4/Tab4.js";
export default class App extends React.Component {
  constructor(props) {
    super(props);
    this.state = {
      sourseRisk: {
        disTechRisK: [
          "Наявні нереалістичні чи неоціненні функціональні характеристики ПЗ",
          "Наявні нереалістичні чи неоціненні характеристики якості ПЗ",
          "Наявні нереалістичні чи неоціненні характеристики надійності ПЗ",
          "Наявні нереалістичні рекомендації щодо майбутньої застосованості ПЗ",
          "Наявні нереалістичні характеристики часової продуктивності ПЗ",
          "Наявні нереалістичні рекомендації щодо майбутньої супроводжуваності ПЗ",
          "Наявні нереалістичні пропозиції щодо повторного використання ПЗ"
        ],
        disValueRisK: [
          "Наявні щодо сумарного бюджету на реалізацію ПЗ",
          "Вказана недоступна вартість реалізації програмного проекту",
          "Присутній низький ступінь реалізму при оцінюванні витрат на ПЗ"
        ],
        disPlanRisK: [
          "Наявні нереалістичні властивості та можливості гнучкості внесення змін до планів життєвого циклу розроблення ПЗ",
          "Наявні нереалістичні можливості порушення встановлених термінів реалізації етапів життєвого циклу розроблення ПЗ",
          "Присутній низький ступінь реалізму при встановленні планів і етапів життєвого циклу розроблення ПЗ"
        ],
        disRealizeRisK: [
          "Відсутні нереалістичні нереалістичні стратегії реалізації програмного проекту",
          "Відсутні нереалістичні методики планування проекту розроблення ПЗ",
          "Відсутні нереалістичні методики оцінювання програмного проекту",
          "Наявне неналежне документування етапів реалізації ПЗ",
          "Відсутні нереалістичні матодики прогнозування результатів реалізації ПЗ"
        ]
      },
      eventRisk: {
        disTechRisK: [
          "Затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ",
          "Затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ",
          "Небажання команди виконавців ПЗ використовувати інструментальні засоби для підтримки процесу розроблення ПЗ",
          "Відмова команди виконавців від CASE-засобів розроблення ПЗ",
          "Формування запитів на більш потужні інструментальні засоби розроблення ПЗ",
          "Недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ",
          "Програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості",
          "Неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ",
          "Неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ",
          "Швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів",
          "Поява дефектних системних компонент, які використовують для розроблення ПЗ"
        ],
        disValueRisK: [
          "Недооцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)",
          "Переоцінювання витрат на реалізацію програмного проекту (надмірно висока вартість)",
          "Фінансові ускладнення у компанії-замовника ПЗ",
          "Фінансові ускладнення у компанії-розробника ПЗ",
          "Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації",
          "Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації",
          "Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ",
          "Реорганізація структурних підрозділів у компанії-замовника ПЗ",
          "Реорганізація команди виконавців у компанії-розробника ПЗ"
        ],
        disPlanRisK: [
          "Зміни графіка виконання робіт з боку замовника чи виконавця;",
          "Порушення графіка виконання робіт у компанії-розробника ПЗ",
          "Потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ",
          "Потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ",
          "Потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ",
          "Недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-розробника ПЗ",
          "Переоцінювання тривалості етапів реалізації програмного проекту",
          "Остаточний розмір ПЗ перевищує заплановані його характеристики",
          "Остаточний розмір ПЗ значно менший за планові його характеристики",
          "Поява на ринку аналогічного ПЗ до виходу замовленого",
          "Поява на ринку більш конкурентоздатного ПЗ"
        ],
        disRealizeRisK: [
          "Низький моральний стан персоналу команди виконавців ПЗ",
          "Низька взаємодія між членами команди виконавців ПЗ",
          "Пасивність керівника (менеджера) програмного проекту",
          "Недостатня компетентність керівника (менеджера) програмного проекту",
          "Незадоволеність замовника результатами етапів реалізації програмного проекту",
          "Недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем",
          "Хвороба провідного виконавця в найкритичніший момент розроблення ПЗ",
          "Одночасна хвороба декількох виконавців підчас розроблення ПЗ",
          "Неможливість організації необхідного навчання персоналу команди виконавців ПЗ",
          "Зміна пріоритетів у процесі управління програмним проектом",
          "Недооцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ",
          "Переоцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ",
          "Надмірне документування результатів на етапах реалізації програмного проекту",
          "Недостатнє документування результатів на етапах реалізації програмного проекту",
          "Нереалістичне прогнозування результатів на етапах реалізації програмного проекту",
          "Недостатній професійний рівень представників від компанії-замовника ПЗ"
        ]
      },
      methods: [
        "Попереднє навчання членів проектного колективу",
        "Узгодження детального переліку вимог до ПЗ із замовником",
        "Внесення узгодженого переліку вимог до ПЗ замовника в договір",
        "Точне слідування вимогам замовника з узгодженого переліку вимог",
        "Попередні дослідження ринку",
        "Експертна оцінка програмного проекту досвідченим стороннім консультантам",
        "Консультації досвідченого стороннього консультана",
        "Тренінг з вивчення необхідних інструментів розроблення ПЗ",
        "Укладення договору страхування",
        "Використання 'Шаблонних' рішень з вдалих попередніх проектів при управлінні програмним проектом",
        "Підготовка документів, які показують важливість даного проекту для досягення фінансових цілей компанії-розробника",
        "Реорганізація роботи проектного колективу так, щоб обов'язки та робота членів колективу перекривали один одного",
        "Придбання (замовлення) частини компонент розроблюваного ПЗ",
        "Заміна потенційно дефектних компонент розроблюваного ПЗ придбаними компонентами, які гарантують якість виконання роботи",
        "Придбання більш продуктивної бази даних",
        "Використання генератора програмного коду",
        "Реорганізація роботи проектного колективу залежно від рівня труднощів виконання завдань та професійних рівнів розробників",
        "Повторне використання придатних компонент ПЗ, які були розроблені для інших програмних проектів",
        "Аналіз доцільності розроблення даного ПЗ"
      ],
      ER: [],
      ERPER: [],
      priority: [],
      VRER: [],
      indexMethods: []
    };
  }

  updateData = (nameData, data) => {
    let tmpData = [];
    tmpData = [...data];
    this.setState({ [nameData]: tmpData }, () => {});
  };

  setER = tmpER => {
    this.setState({ ER: tmpER }, () => {});
  };
  render() {
    return (
      <Container fluid>
        <Tabs defaultActiveKey="Tab3" className="tabs">
          <Tab eventKey="Tab1" title="Ідентифікація ризиків розроблення ПЗ">
            <Tabs defaultActiveKey="Tab1_1" className="tabs">
              <Tab eventKey="Tab1_1" title="Джерела появи ризиків">
                <Tab11 data={this.state} />
              </Tab>
              <Tab eventKey="Tab1_2" title="Потенційні ризикові події">
                <Tab12 data={this.state} />
              </Tab>
            </Tabs>
          </Tab>
          <Tab eventKey="Tab2" title="Аналіз ризиків розроблення ПЗ">
            <Tab2 data={this.state} setER={this.setER} />
          </Tab>
          <Tab eventKey="Tab3" title="Величина ризиків">
            <Tab3 data={this.state} updateData={this.updateData} />
          </Tab>
          <Tab eventKey="Tab4" title="Усунення ризиків">
            <Tab4 data={this.state} updateData={this.updateData} />
          </Tab>
          <Tab eventKey="Tab5" title="Моніторинг ризиківі">
            <div>5</div>
          </Tab>
          <Tab eventKey="Tab6" title="Результуюча величина ризику">
            <div>6</div>
          </Tab>
        </Tabs>
      </Container>
    );
  }
}
